Repository: Zaki-Malla/GameHubManager
Catalog: GameHubManager/Resources/SharedResource.*.resx
Languages: ar

source: Account Settings
ar: إعدادات الحساب

source: Activate
ar: تفعيل

source: Add Another Item
ar: إضافة عنصر آخر

source: Add New Account
ar: إضافة حساب جديد

source: Add New Device
ar: إضافة جهاز جديد

source: Add New Device Type
ar: إضافة نوع جديد

source: Add New Item
ar: إضافة عنصر جديد

source: Add New Price
ar: إضافة سعر جديد

source: Admin Control Panel
ar: لوحة تحكم الأدمن

source: Admin Dashboard
ar: لوحة الآدمن

source: Amount Due
ar: السعر المستحق

source: Amount due for each device:
ar: المبلغ المستحق لكل جهاز:

source: Amount Due Per Device
ar: المبلغ المستحق لكل جهاز

source: Amount Paid
ar: السعر المدفوع

source: Amount paid for all devices:
ar: المبلغ المدفوع لكافة الأجهزة

source: Amount paid for each device:
ar: المبلغ المدفوع لكل جهاز

source: Amount Taken
ar: المبلغ المأخوذ

source: Amount to be refunded:
ar: المبلغ الواجب إرجاعه:

source: Amount to be refunded for all devices:
ar: المبلغ الواجب إرجاعه لكافة الأجهزة:

source: Amount to be refunded per device:
ar: المبلغ الواجب إرجاعه لكل جهاز:

source: Are you sure you want to delete this device?
ar: هل أنت متأكد من حذف هذا الجهاز؟

# audioNotPlayedReason
source: Audio was not played because:
ar: لم يتم تشغيل الصوت بسبب:

source: Available Devices:
ar: عدد الأجهزة المتاحة:

source: Available Quantity:
ar: الكمية المتاحة:

source: Back to Home Screen
ar: العودة للشاشة الرئيسية

source: Back To List
ar: العودة للقائمة

source: Biscuits
ar: بسكويت

source: Buy Date
ar: تاريخ الشراء

source: Category
ar: التصنيف

source: Certain Period Profit Report
ar: تقرير الارباح خلال فترة معينة

source: Choose Category
ar: اختر التصنيف

source: Choose Device Type
ar: اختر نوع الجهاز

source: Close
ar: إغلاق

source: Close Reservation
ar: إغلاق الحجز

source: Cold Drinks
ar: مشاريب باردة

source: Color Scheme
ar: نظام الألوان

# completeReservationNow
source: Complete the reservation now
ar: إنهاء الحجز الآن

source: Confirm Close
ar: تأكيد الإغلاق

source: Confirm Group Reservation
ar: تأكيد الحجز الجماعي

source: Confirm Reservation
ar: تأكيد الحجز

source: Confirm Sale
ar: تأكيد البيع

# containsControllers
source: Does it contain controllers?
ar: هل يحتوي على قبضات؟

source: Controllers
ar: قبضات اللعب

# copyrightNotice
source: © 2025 Zaki Malla. All rights reserved. Unauthorized use or distribution is prohibited.
ar: © 2025 زكي ملا. جميع الحقوق محفوظة. استخدام أو توزيع غير مصرح به محظور.

source: Current Quantity
ar: الكمية الحالية

source: customize
ar: تخصيص

source: Dark
ar: داكن

source: Dashboard
ar: لوحة التحكم

source: Delete
ar: حذف

# deleteDeviceTypeConfirmation
source: Are you sure you want to delete this type?
ar: هل أنت متأكد من حذف هذا النوع؟

source: Device List
ar: قائمة الأجهزة

source: Device Name
ar: اسم الجهاز

source: Device Price List
ar: قائمة انواع الأجهزة

# deviceReservationEnded
source: Device reservation has ended:
ar: انتهى حجز الجهاز:

source: Devices
ar: الأجهزة

source: Devices List
ar: قائمة الأجهزة

source: Device Type
ar: نوع الجهاز

source: Device Type List
ar: قائمة انواع الأجهزة

source: Device Type Name
ar: اسم النوع

source: Device Types
ar: أنواع الأجهزة

source: Edit
ar: تعديل

source: Edit Device
ar: تعديل جهاز

source: Edit Device Type
ar: تعديل نوع الجهاز

source: Edit Price
ar: تعديل السعر

source: Email
ar: البريد الإلكتروني

source: Employee List
ar: قائمة الموظفين

source: Employee Name
ar: اسم الموظف

source: End Time
ar: وقت النهاية:

# errorClosingReservation
source: An error occurred while closing the reservation.
ar: حدث خطأ أثناء إغلاق الحجز

# errorCompletingReservation
source: An error occurred while completing the reservation.
ar: حدث خطأ أثناء إنهاء الحجز.

# errorConnectingToServer
source: An error occurred while connecting to the server.
ar: حدث خطأ أثناء الاتصال بالخادم

# errorDuringSale
source: An error occurred during the sale!
ar: حدث خطأ أثناء البيع!

# errorPriceMessage
source: You must enter a price greater than 0
ar: يجب إدخال سعر أكبر من 0

# errorQuantityMessage
source: You must enter a quantity greater than 0
ar: يجب إدخال كمية أكبر من 0

# exploreStyles
source: Explore different styles according to your preferences
ar: استكشف الأنماط المختلفة حسب تفضيلاتك

source: Filter
ar: إظهار

source: First Date
ar: التاريخ الأول

source: Game Hour Price
ar: سعر ساعة اللعب

source: General Statistics
ar: احصائيات عامة

source: Group Reservation for PCs
ar: حجز جماعي لأجهزة الكمبيوتر

source: Hot Drinks
ar: مشاريب ساخنة

source: Hour
ar: ساعة

source: Hourly Rate
ar: سعر الساعة

# hourlyRateForDevice
source: Hourly rate for the device:
ar: سعر الساعة للجهاز:

source: Hourly rate not set
ar: سعر الساعة غير محدد

source: Image
ar: الصورة

source: Indomi
ar: اندومي

# IsReservationOpen
source: Is the reservation open?
ar: هل الحجز مفتوح؟

source: Item Name
ar: اسم العنصر

source: Item Price
ar: سعر المنتج

source: Language
ar: اللغة

source: Light
ar: إضاءة

source: Lira
ar: ليرة

source: Log in
ar: تسجيل الدخول

# loginAccessDashboard
source: Log in to access your dashboard.
ar: قم بتسجيل الدخول للوصول إلى لوحة التحكم الخاصة بك.

source: Login with email
ar: الدخول بالبريد الإلكتروني

source: Log out
ar: تسجيل الخروج

source: Manage Menu Item Types
ar: إدارة أنواع الوجبات

source: Meal Name
ar: اسم الوجبة

source: Minute
ar: دقيقة

# Monthlyearningreport
source: Monthly earnings report
ar: تقرير الأرباح الشهرية

# mustSelectAtLeastOneDevice
source: You must select at least one device.
ar: يجب اختيار جهاز واحد على الأقل.

# newQuantity
source: Enter the quantity to be added
ar: أدخل الكمية المراد إضافتها

source: No
ar: لا

source: No Available Devices
ar: لا يوجد أجهزة متاحة

source: No Controllers
ar: لا يوجد قبضات

# noDevicesAvailable
source: No devices are currently available.
ar: لا توجد أجهزة متاحة حالياً.

source: Not Specified Yet
ar: لم يحدد بعد

source: No types registered
ar: لا يوجد أنواع مسجلة

source: Number of Available Devices:
ar: عدد الأجهزة المتاحة:

source: Number Of Controllers
ar: عدد القبضات

source: Number of devices:
ar: عدد الأجهزة:

source: Number of minutes played so far:
ar: عدد الدقائق الملعوبة حتى الآن:

source: Number of minutes reserved:
ar: عدد الدقائق المحجوزة:

source: Number Of Minutes Used:
ar: عدد الدقائق المستخدمة:

source: Number of Play Minutes
ar: عدد دقائق اللعب

source: Number Of Selected Controllers:
ar: عدد القبضات المختارة:

source: Number of Units
ar: عدد القطع

source: Number Of Users
ar: عدد المستخدمين

source: Open Reservation
ar: حجز مفتوح

# operationFailed
source: The operation failed!
ar: فشلت العملية!

# operationSuccessful
source: The operation was successful!
ar: تمت العملية بنجاح!

source: Options
ar: خيارات

source: Password
ar: كلمة المرور

source: Per Hour
ar: لكل ساعة

source: Phone Number
ar: رقم الهاتف

source: Playing Rate List
ar: قائمة اسعار اللعب

# pleaseEnterValidPaymentAmount
source: Please enter a valid amount for the payment.
ar: يرجى إدخال قيمة صحيحة للمبلغ المدفوع.

source: Price
ar: السعر

source: Price List of Device Types
ar: قائمة اسعار انواع الأجهزة

source: Price per Unit:
ar: السعر للقطعة:

source: Profit By Certain Period
ar: ربح خلال فترة معينة

source: Profit By Current Month
ar: ربح هذا الشهر

source: Profit By Today
ar: ربح اليوم

source: Profit Statistics
ar: إحصائيات الأرباح

source: Quantity
ar: الكمية

source: Quantity After Addition
ar: الكمية بعد الإضافة

source: Remaining Time:
ar: الوقت المتبقي:

source: Renew Quantity
ar: تجديد الكمية

# reservationByCertainPeriod
source: Reservation By Certaion Period
ar: حجوزات خلال فترة معينة

source: Reservation By Current Month
ar: حجوزات هذا الشهر

source: Reservation By Today
ar: حجوزات اليوم

source: Reservation Date
ar: تاريخ الحجز

source: Reservation is open
ar: الحجز مفتوح

# reservationPrice
source: Reservaion Price
ar: سعر الحجز

# reservationReoport
source: Reservation Report
ar: تقرير الحجوزات

source: Reservation Statistics
ar: إحصائيات الحجوزات

source: Reserve Device
ar: حجز الجهاز

source: Reserve Now
ar: احجز الآن

source: Reset to default
ar: إعادة تعيين إلى الإعدادات الافتراضية

source: Sale completed successfully!
ar: تم البيع بنجاح!

source: Save
ar: حفظ

source: Second Date
ar: التاريخ الثاني

# SelectAvailableDevices
source: Please select the available devices (unreserved PCs):
ar: الرجاء اختيار الأجهزة المتاحة (أجهزة الكمبيوتر غير المحجوزة):

source: Select Category
ar: اختر التصنيف

source: Selected reservation details:
ar: تفاصيل الحجز المحدد:

source: Select Group Reservation
ar: اختر حجز جماعي

source: Select Item
ar: اختر العنصر

source: Sell Multiple Items
ar: بيع عناصر متعددة

source: Sell New Item from Fridge
ar: بيع عنصر جديد من البراد

# setPlayPriceFirst
source: You must set the play price before making a reservation.
ar: يجب تحديد سعر اللعب أولاً قبل الحجز.

source: Set the price
ar: تحديد السعر

source: Snacks List
ar: مبيعات المأكولات والمشروبات

source: Start Time:
ar: وقت البداية:

source: Statistics
ar: الإحصائيات

source: System Statistics 📊
ar: 📊 إحصائيات النظام

source: Theme Customizer
ar: مخصص المظهر

source: There Are Controllers
ar: يوجد قبضات

source: Total
ar: المجموع

source: Total Amount Due for All Devices
ar: المبلغ المستحق لجميع الأجهزة

source: Total amount for all devices:
ar: المبلغ الكلي لكافة الأجهزة:

source: Total Sales In Current Month
ar: إجمالي المبيعات هذا الشهر

source: Update Date
ar: تاريخ التحديث

source: Update Price
ar: تحديث السعر

source: Upload Image
ar: تحميل صورة

source: View Group Reservations
ar: عرض الحجوزات الجماعية

source: Welcome back! 🎉😊
ar: مرحبًا بعودتك! 🎉😊

source: Yes
ar: نعم
